#include <stdio.h>
#include <stdlib.h>

int shop(int m , int n , int *k , int **c)
{
	int x , **t , i , j , l , flag , Μin , y , S;
	x=m+1; 
	t= (int **) malloc(n * sizeof(int *));                                     //Δέσμευση δυναμικής μνήμης για τον πίνακα t
	if (t==NULL) {                                                            //αμα δεν γινετε  εμφανίζει κατάλληλο διαγνωστικό μήνυμα.
		printf("Error, not memory available \n"); 
		return 1;
	}
	for (i=0; i<n; i++){
		t[i]= (int *) malloc(x * sizeof(int));                               //Δεσμεύω δυναμικά μνήμη για τις στήλες του πίνακα (x2)
		if (t[i]==NULL){
			printf("Error, not memory available\n");                        //αμα δεν γινετε  εμφανίζει κατάλληλο διαγνωστικό μήνυμα.
			return 1;
		}
	}	
	for (i=0; i<n; i++){
		for (j=0; j<x; j++){
			t[i][j]=0;                                                   //Αρχικοποιώ τον πίνακα με 0
		}
	}	
	for (i=0; i<n; i++){                                                //για κάθε προιόν
	  if(i==0){                                                       
		for (l=0; l<k[i]; l++){                                        //Για κάθε στήλη του πίνακα c
		   for (j=0; j<x; j++){                                       //Για κάθε στήλη του πίνακα t
		      if (j==m-c[i][l]){                                     //Αν η τιμή την στήλης = με το υπόλοιπο αν αγοράσει το αντίστοιχο προιόν της πρώτης γραμμής
			     t[i][j]=1;                                           //παίρνει την τιμή 1
		      }   
	       }
	    }
	  } 
	  else                                                        //Αν δεν είμαστε στο πρώτο προιόν
	  {
	  	for (l=0; l<k[i]; l++){                                  //Για κάθε στήλη του πίνακα c
	  		for (j=0; j<x; j++){                               //Για κάθε στήλη του πίνακα t
	  			if (t[i-1][j]==1){                           //Αν στην προηγούμενη γραμμή και στην ίδια στήλη ο πίνακας έχει την τιμή 1 
	  				y=j-c[i][l];                           //Αφαιρώ από τα υπολιπα  χρήματα  το κόστος κάποιου μοντέλου του συγκεκριμένου προιόντος
	  				if (y>=0){                             //Εφόσον είναι δείκτης σε πίνακα πρέπει να είναι >=0  
	  				  t[i][y]=1;                       //Θα πάρει την τιμή 1
	  			    }
			    }
			}
		}
	  }
	}
	i=n-1;                                     //Ελέγχω την τελευταία γραμμή
	j=0;   
	flag=0;                            //Έστω οτι η flag  λογική μεταβλήτη ,με 0 να ειναι  ψευδής
	Μin=m;                           //Αρχικοποιώ το min με το πόσο που εκχοριθικε
	while (j<x && flag==0){            //Όσο η flag παραμένει 0 και υπάρχουν στήλες συνεχίζει η επανάληψη
		if (t[i][j]==1){                 //Ψάχω την πρώτη στήλη της τελευταίας γραμμής που έχει 1.Αν την βρω τότε τερματίζω την επανάληψη θέτωντας flag=1 και αποθηκεύω την στήλη που το βρήκα 
			Μin=j; 
			flag=1; 
		}
		j++;                              
	}
	for (i=0; i<n; i++){
		free(t[i]);                            //Αποδεσμεύω την μνήμη
	}
	free (t); 
	S=m-Μin; 
	return S; 
}

